#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "Russian");
	int N;
	cout << "N=";
	cin >> N;
	string a[] = { "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать",
	"восемнадцать", "девятнадцть", "двадцать",	"двадцать одно", "двадцать два", "двадцать три", "двадцать четыре", "двадцать пять",
	"двадцать шесть", "двадцать семь", "двадцать восемь",	"двадцать девять", "тридцать", "тридцать одно", "тридцать два", "тридцать три",
	"тридцать четыре", "тридцать пять", "тридцать шесть",	"тридцать семь", "тридцать восемь", "тридцать девять", "сорок" };
	cout << a[N-10];
	if ((N ==21) || (N == 31))
	    cout << " учебноe задание";
	else if ((N / 10 > 1) && ((N % 10 == 2) ||(N % 10 == 3)||(N % 10 == 4)))
	    cout << " учебных задания";
	else
	    cout << " учебных заданий";
}
