#include <iostream>
using namespace std;
int main() {
	setlocale(LC_ALL, "Russian");
	int D, M;
	string d[] = { "первое","второе","третье","четвертое","пятое","шестое","седьмое","восьмое","девятое","десятое","одиннадцатое","двенадцатое,","тринадцатое",
	"четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое", "девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе",
	"двадцать третье","двадцать четвертое", "двадцать пятое", "двадцать шестое", "двадцать седьмое", "двадцать восьмое", "двадцать девятое", "тридцатое", "тридцать первое"};
	string m[] = { "января","февраля","марта","апреля","мая","июня","июля","августа","сентября","октября","ноября","декабря" };
	cout << "введите число ";
	cin >> D;
	cout << "введите номер месяца ";
	cin >> M;
	cout <<d[D - 1];
	cout << " " << m[M - 1];
}
